///-----------------------------------------------------------------------------
/// @desc scr_VirtualControllerButtons
///-----------------------------------------------------------------------------

	// Button IDs
	enum Buttons
	{
		Up,																		// 上
		Down,																	// 下
		Left,																	// 左
		Right,																	// 右
		A,																		// A ボタン
		B,																		// B ボタン
		Start,																	// スタートボタン
		Select,																	// セレクトボタン
		Number,																	// ボタンの個数 (末尾に書くこと)
	}